## Importing Packages

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## Importing the data

In [2]:
dataset = pd.read_csv('PartD.txt',sep='\t',error_bad_lines=False)
print(dataset.shape)
dataset.head(3)

(1162898, 84)

,npi,nppes_provider_last_org_name,nppes_provider_first_name,nppes_provider_mi,nppes_credentials,nppes_provider_gender,nppes_entity_code,nppes_provider_street1,nppes_provider_street2,nppes_provider_city,...,beneficiary_male_count,beneficiary_race_white_count,beneficiary_race_black_count,beneficiary_race_asian_pi_count,beneficiary_race_hispanic_count,beneficiary_race_nat_ind_count,beneficiary_race_other_count,beneficiary_nondual_count,beneficiary_dual_count,beneficiary_average_risk_score
0,1003000126,ENKESHAFI,ARDALAN,NaN,M.D.,M,I,900 SETON DR,NaN,CUMBERLAND,...,92.0,220.0,14.0,0.0,0.0,0.0,0.0,143.0,91.0,2.1685
1,1003000142,KHALIL,RASHID,NaN,M.D.,M,I,4126 N HOLLAND SYLVANIA RD,SUITE 220,TOLEDO,...,92.0,195.0,58.0,NaN,NaN,0.0,NaN,143.0,133.0,1.8029
2,1003000167,ESCOBAR,JULIO,E,DDS,M,I,5 PINE CONE RD,NaN,DAYTON,...,17.0,NaN,0.0,0.0,NaN,0.0,0.0,NaN,NaN,1.0598

In [3]:
countProvider = dataset['npi'].nunique()
print("The dataset has data for a total of",countProvider, "providers")

The dataset has data for a total of 1162898 providers

## Question - 1

#### We extract the 'beneficiary_dual_count' column from the main dataset.

In [4]:
beneCount = dataset[['beneficiary_dual_count']]
beneCount = beneCount.reset_index(drop=True)
beneCount.head()

   beneficiary_dual_count
0                    91.0
1                   133.0
2                     NaN
3                     NaN
4                     NaN

We now filter the dataset with for entries where 'beneficiary_dual_count' is greater than 10 and claculate the mean.

In [5]:
beneCountFiltered = beneCount[beneCount['beneficiary_dual_count']>10]
beneCountFiltered = beneCountFiltered.reset_index(drop=True)
beneCountFiltered['beneficiary_dual_count'].mean()

68.38656090414013

## Question - 2

#### We form a new dataset by extracting two columns from the main datsaet, i.e., 'total_day_supply', and 'total_claim_count', find the 'difference' and calculate the median

In [6]:
filteredData = dataset[['total_day_supply','total_claim_count']]
filteredData = filteredData.reset_index(drop=True)
difference = filteredData['total_day_supply'] - filteredData['total_claim_count']
difference.median()

4479.0

## Question - 3

#### We extract three columns from the main dataset, i.e., 'specialty_description','total_claim_count','brand_claim_count' and form a new datset.

In [7]:
new_data = dataset[['specialty_description','total_claim_count','brand_claim_count']]
new_data = new_data.reset_index(drop=True)
new_data.head()

  specialty_description  total_claim_count  brand_claim_count
0     Internal Medicine                677                NaN
1        Anesthesiology               1946              235.0
2               Dentist                 55                0.0
3               Dentist                 18                0.0
4    Nurse Practitioner                 90               28.0

#### We next filter the data on condition 'total_claim_count' > 1000 below

In [8]:
new_dataFiltered = new_data[new_data['total_claim_count']>1000]
new_dataFiltered = new_dataFiltered.reset_index(drop=True)
print(new_dataFiltered.shape)
new_dataFiltered.head()

(290006, 3)

  specialty_description  total_claim_count  brand_claim_count
0        Anesthesiology               1946              235.0
1       Family Practice               2788                NaN
2       Family Practice               4981              677.0
3     Internal Medicine               7165              956.0
4       Family Practice               7054             1147.0

In [9]:
countSpeciality = new_dataFiltered['specialty_description'].nunique()
print(countSpeciality)

110

#### We next group the data for each speciality, calculate the 'fraction' of 'brand_claim_count'  to 'total_claim_count'. We then find the standard devition of the 'fraction'.

In [10]:
new_dataFilteredGroup = new_dataFiltered.groupby(['specialty_description'])['total_claim_count','brand_claim_count'].agg('sum')
print(new_dataFilteredGroup.shape)
new_dataFilteredGroup.head()

(110, 2)

                          total_claim_count  brand_claim_count
specialty_description
Addiction Medicine                   171989            28515.0
Allergy/ Immunology                 1712745           484488.0
Anesthesiology                      4575942           416095.0
Anesthesiology Assistant               1343              667.0
Behavior Analyst                       2015              194.0

In [11]:
new_dataFilteredGroup['fraction'] = new_dataFilteredGroup['brand_claim_count']/new_dataFilteredGroup['total_claim_count']
new_dataFilteredGroup = new_dataFilteredGroup.reset_index(drop=True)
print(new_dataFilteredGroup.shape)
new_dataFiltered.head()

(110, 3)

  specialty_description  total_claim_count  brand_claim_count
0        Anesthesiology               1946              235.0
1       Family Practice               2788                NaN
2       Family Practice               4981              677.0
3     Internal Medicine               7165              956.0
4       Family Practice               7054             1147.0

In [12]:
new_dataFilteredGroup['fraction'].std()

0.09437176296799718

## Question 4

#### We extract the required columns in a new datset.

In [13]:
newData = dataset[['nppes_provider_state','opioid_bene_count','antibiotic_bene_count']]
newData = newData.reset_index(drop=True)
print(newData.shape)
newData.head()

(1162898, 3)

  nppes_provider_state  opioid_bene_count  antibiotic_bene_count
0                   MD               24.0                  104.0
1                   OH              200.0                    0.0
2                   NV               11.0                   22.0
3                   CA                0.0                    NaN
4                   TN                0.0                    0.0

####  We calculate the aggregated sum of the two columns for each state.

In [14]:
newDataGroup = newData.groupby(['nppes_provider_state'])['opioid_bene_count','antibiotic_bene_count'].agg('sum')
print(newDataGroup.shape)
newDataGroup.head()

(61, 2)

                      opioid_bene_count  antibiotic_bene_count
nppes_provider_state
AA                                145.0                  496.0
AE                                982.0                 1986.0
AK                              20045.0                25223.0
AL                             539041.0               763225.0
AP                                688.0                 1627.0

#### We calculate the ratio of beneficiaries with opioid prescriptions to beneficiaries with antibiotics prescriptions in each state, and find the difference between the largest and smallest ratios.

In [15]:
newDataGroup['fraction'] = newDataGroup['opioid_bene_count']/newDataGroup['antibiotic_bene_count']
newDataGroup = newDataGroup.reset_index(drop=True)
print(newDataGroup.shape)
newDataGroup.head()

(61, 3)

   opioid_bene_count  antibiotic_bene_count  fraction
0              145.0                  496.0  0.292339
1              982.0                 1986.0  0.494461
2            20045.0                25223.0  0.794711
3           539041.0               763225.0  0.706267
4              688.0                 1627.0  0.422864

In [16]:
newDataGroup['fraction'].max() - newDataGroup['fraction'].min()

0.6331097230267027

## Question 5

#### We form a new dataset as required. We claculate the fraction of claims for beneficiaries age 65 and older against the number of total claims. We carry out a similar analysis to find fraction for beneficiaries with a low-income subsidy against the number of total claims and find the pearson corrlation coefficient.

In [17]:
newData = dataset[['npi','total_claim_count','total_claim_count_ge65','lis_claim_count']]
newData = newData.reset_index(drop=True)
newData['fraction_ge65'] = newData['total_claim_count_ge65']/newData['total_claim_count']
newData['fraction_lis'] = newData['lis_claim_count']/newData['total_claim_count']
newData = newData.reset_index(drop=True)
newDatav1 = newData[['fraction_ge65','fraction_lis']]
newDatav1['fraction_ge65'].corr(newDatav1['fraction_lis'])

-0.6389319595676912

## Question 6

#### We import the desired column from the 2016 data.

In [18]:
dataset16 = pd.read_csv('PartD_16.txt',sep='\t',error_bad_lines=False)
cost16 = dataset16[['npi', 'total_claim_count']]
cost16 = cost16.reset_index(drop=True)
print(cost16.shape)
cost16.head()

(1131550, 2)

          npi  total_claim_count
0  1003000126                545
1  1003000142               1733
2  1003000167                 49
3  1003000282                146
4  1003000407               2225

#### Next, we import the desired column from the 2017 data.

In [19]:
cost17 = dataset[['npi', 'total_claim_count']]
cost17 = cost17.reset_index(drop=True)
print(cost17.shape)
cost17.head()

(1162898, 2)

          npi  total_claim_count
0  1003000126                677
1  1003000142               1946
2  1003000167                 55
3  1003000175                 18
4  1003000282                 90

#### We merge the two datsets based on the 'npi' values below

In [20]:
mergedData = pd.merge(cost16, cost17, on="npi")
mergedData.head()

          npi  total_claim_count_x  total_claim_count_y
0  1003000126                  545                  677
1  1003000142                 1733                 1946
2  1003000167                   49                   55
3  1003000282                  146                   90
4  1003000407                 2225                 2788

#### We calculate the avergae per day cost for prescription for 2016 and 2017. We take their difference and calculate the average inflation.

In [21]:
mergedData['fraction16'] = mergedData['total_claim_count_x']/365
mergedData['fraction17'] = mergedData['total_claim_count_y']/365
mergedData['fractionDiff'] = mergedData['fraction17'] - mergedData['fraction16'] 
mergedData.head()

,npi,total_claim_count_x,total_claim_count_y,fraction16,fraction17,fractionDiff
0,1003000126,545,677,1.493151,1.854795,0.361644
1,1003000142,1733,1946,4.747945,5.331507,0.583562
2,1003000167,49,55,0.134247,0.150685,0.016438
3,1003000282,146,90,0.400000,0.246575,-0.153425
4,1003000407,2225,2788,6.095890,7.638356,1.542466

In [22]:
mergedData['fractionDiff'].mean()

0.0188846894086364